{
    "backgroundChildhood": "So you probably know by now that my name is Andrew. But let's start from the beginning, I was born on March 27th, 2000. I grew up in Franklin, Tennessee, a small and historic town that's about 30 minutes south of Nashville. For most people, Tennessee is known for a few things: Country Music, Nashville Hot Chicken, Jack Daniels, and everything else southern. While all of that is certainly true (shoutout to Shake's Hot Chicken and Fish), It is also home for me. What I love to tell people about where I grew up is how beautiful it is. I love the golden sunshine, the pristine parks, the gorgeous hiking trails. I love wandering on hot summer days and greeting friendly people. I love the serenity, the quiet, and the pace of life that lets me breathe. Tennessee has its fair share of problems, but when I'm asked about where I'm from, I remember the parts that allowed me to have a wonderful childhood.",
    "backgroundFamily": "Who you're surrounded by is a large part of anyone's identity, and I've been fortunate enough to be surrounded by an amazing group of people. While a large portion of the people that surround me are my friends, I want to dedicate this to my family. First and foremost is my Mom, who raised me and who I have so much love and respect for. She's one of the strongest and most loving people in my life, and a role model for me. My brother, who has always been special to me for his unending kindness and ability to understand me. My step dad, who came into my family with out missing a beat caring and loving all of us. And of course, my cat, Kaiser, who I give a lot of unrequited love to. He's a tempermental and photogenic fluff ball, but I always am excited to see him on trips home.",
    "backgroundHobbies": "Some of my favorite hobbies are cooking, playing tennis, video games, and board games. Cooking is something I started in early high school because I've always been a big foodie. Now, it's a cool way to explore making dishes from around the world, or tasting home cooking wherever I am. I started playing tennis at around age 12, and It's always been a therapeutic activity for me. Going out on a beautiful day and hitting a ball with some friends is a greay way to spend an afternoon (also side note I am a Federer fan :P). I've been playing video games all my life, and I've always appreciated their ability to tell a story and immerse me in another world. Nobodies asking but if I had to give a top 3, in no particular order they'd be Outer Wilds, Talos Principle, Dark Souls 3. Finally, I love board games. The physical aspect of getting together with friends and spreading a gamee out on a table will never change. Two of my favorite board games are Root and Coup, very different in length but both are great!",
    "backgroundAdulthood": "Today, I'm working on living a happy and full life. As I wrap up college and go off onto the next phase of life, I am increasingly learning to enjoy my time in the now. Without repeating myself too many times, I've come to appreciate and understand how much fortune I have to be able to live the life I have surrounded by amazing people. Part of appreciating that is taking full use of those opportunities in my career. Another part is giving back to communities, whether by volunteering or simply helping others. Regardless, I'm enjoying life right now, and if you'd like to contact me, scroll below! Thanks for reading a little bit about me :)"
}  