{
    "twistedTowers": {
        "title": "Twisted Towers",
        "time": "May 2023",
        "links": [{ "linkTitle": "github", "linkUrl": "https://github.com/andrewydai/twisted-towers"}],
        "description": "Twisted towers is a personal project and challenge for myself to replicate the game Tricky Towers, a popular tetris versus games. I've been working to re-implement in Unity 2D, and including writing the logic for game management, collisions and physics, block spawning and player input, and more!"
    },
    "personalWebsite": {
        "title": "Personal Website",
        "time": "May 2021",
        "links": [{ "linkTitle": "github", "linkUrl": "https://github.com/andrewydai/andrewydai-website"}],
        "description": "This is my personal site! This site is personal project built in JavaScript and React. I used a Next.js framework and Netlify to deploy it. I built my personal website to showcase some of the work i've done and to help people learn a little more about me."
    },
    "pingPongBoard": {
        "title": "Ping Pong Board",
        "time": "August 2021",
        "links": [{ "linkTitle": "github", "linkUrl": "https://github.com/andrewydai/disknee-ping-pong"}, { "linkTitle": "herokuapp", "linkUrl": "http://disknee-ping-pong-leaderboard.herokuapp.com/"}],
        "description": "This is a small webapp written in JavaScript and React and hosted on Heroku for my roommates and I. I created this app to help keep track of a ping pong ladder. Users can submit the results of matches, and ratings will update based on an ELO system. These changes are propagated to a dattabase, which for now is a spreadsheet interfaced with the sheet.best. API"
    },
    "adventureBot": {
        "title": "Adventure Bot",
        "time": "January 2020",
        "links": [],
        "description": "Adventure bot is a small project that I started to try to explore simulating a DnD like experience with a discord bot. The project started as a class project in a Game Design course. After the course, I continued building parts of it. At its core, it is a Javascript Node.js server that uses the Discord API to run a bot. The bot is interacted with through channels and direct messages, and is meant to take over the role of being a Dungeon Master and setting up TTRPG sessions. The project provides a really interesting dive into how to tackle smarter generation of character and story."
    },
    "sandbox": {
        "title": "Kirby Bullet Hell",
        "time": "October 2018",
        "links": [],
        "description": "Kirby Bullet hell is a project that my friends and I created at the 2018 Boston Hacks Hackathon. The project was coded in Racket Scheme, a functional language similar to Lisp. The project uses a Big-bang to create a simple game engine, with physics, projectile motion, and collision. We designed, plan, and developed the project over the course of the weekend. In the game, the player tries to capture points on the map while avoiding increasingly dense projectiles of different behaviors."
    }
}