{
    "introText1": "A little about myself! I am 23, I live in Boston, and I graduated last year from Northeastern University with a degree in Computer Science. My time at NEU was filled with amazing opportunities to learn, develop, and make memories. For example, my freshman year I was recruited to work on a research project but my first Computer Science project, and got a chance to see what academia might be like. That same year. I studied in math in Budapest, Hungary for a half a semester, learning some of the rich mathematical heritage that exists there. My sophomore year, I worked full time at PowerAdvocate as part of Northastern’s co-op system. There, I got to experience what industry software development might be like for the first time. Working there was some of my most cherished memories, and I still frequently go to their biannual get togethers. While COVID certainly disrupted my life like many others, I was fortunate enough to be able to work again my junior year at another company, AppFolio. AppFolio gave me even more chances to learn and prove myself in the tech industry, and I’m truly grateful for the supportive and kind people there.",
    "introText2": "Throughout this time, I’ve also had chances to spread my wings a bit. I’ve always loved math, and have taken a math minor to express that passion. I’ve also enjoyed taking some game design and typographic design courses. In some of my spare time, I’ve found it fulfilling to contribute to awesome community service clubs like Peace Through Play and FirstByte. I’ve also been able to contribute at Sandbox, a student ran software consultancy. These experiences have all helped me grow in so many ways. And while I’m proud of my achievements, I’m also equally appreciative of the people who have helped me get there.",
    "introText3": "I am currently seeking full time employment, beginning in September of this year. My experience is predominantly in product engineering of web applications, but I am open to any type of software engineering!"
}